In [1]:
import pandas as pd

In [3]:
sales = pd.read_csv("C:/Users/Abhi/Desktop/Power_BI_Data_Analysis_Project/retail-demand-customer-analytics/data/raw/sales_raw.csv", parse_dates=["date"])
customers = pd.read_csv("C:/Users/Abhi/Desktop/Power_BI_Data_Analysis_Project/retail-demand-customer-analytics/data/raw/customers_raw.csv")
products = pd.read_csv("C:/Users/Abhi/Desktop/Power_BI_Data_Analysis_Project/retail-demand-customer-analytics/data/raw/products_raw.csv")
stores = pd.read_csv("C:/Users/Abhi/Desktop/Power_BI_Data_Analysis_Project/retail-demand-customer-analytics/data/raw/stores_raw.csv")

In [5]:
# Remove duplicates
sales.drop_duplicates(inplace=True)

In [7]:
# Fix data types
sales["quantity"] = sales["quantity"].astype(int)
sales["revenue"] = sales["revenue"].astype(float)

In [9]:
# Filter invalid records
sales = sales[
    (sales["quantity"] > 0) &
    (sales["unit_price"] > 0) &
    (sales["discount"] >= 0) &
    (sales["discount"] <= 0.5)
]

In [13]:
sales.head()

,order_id,date,customer_id,product_id,store_id,quantity,unit_price,discount,revenue
0,1,2024-08-02,1,15,1,3,2206,0.05,6287.1
1,2,2021-10-13,2,95,4,5,912,0.15,3876.0
2,3,2021-03-07,2,4,3,2,2105,0.00,4210.0
3,4,2024-02-24,3,26,18,4,2005,0.15,6817.0
4,5,2024-04-21,3,36,1,2,3662,0.10,6591.6

In [17]:
customers = customers.drop_duplicates(subset="customer_id")

In [19]:
customers.head()

   customer_id  gender  age       city
0            1    Male   34       Pune
1            2  Female   26      Delhi
2            3    Male   50     Mumbai
3            4    Male   37  Bangalore
4            5    Male   30      Delhi

In [25]:
products = products.drop_duplicates(subset="product_id")

In [27]:
products.head()

   product_id  category
0           1   Grocery
1           2  Clothing
2           3   Grocery
3           4  Clothing
4           5  Clothing

In [31]:
stores = stores.drop_duplicates(subset="store_id")

In [33]:
stores["store_type"] = stores["store_type"].fillna("Unknown")

In [35]:
stores .head()

   store_id store_type region
0         1     Online   East
1         2    Offline  South
2         3    Offline   West
3         4    Offline   East
4         5     Online  North

In [37]:
print("Sales rows:", sales.shape)
print("Customers rows:", customers.shape)
print("Products rows:", products.shape)
print("Stores rows:", stores.shape)

Sales rows: (2164, 9)
Customers rows: (1000, 4)
Products rows: (120, 2)
Stores rows: (20, 3)

In [39]:
print("\nMissing values in sales:")
print(sales.isnull().sum())

Missing values in sales:
order_id       0
date           0
customer_id    0
product_id     0
store_id       0
quantity       0
unit_price     0
discount       0
revenue        0
dtype: int64

In [41]:
sales.to_csv("C:/Users/Abhi/Desktop/Power_BI_Data_Analysis_Project/retail-demand-customer-analytics/data/processed/clean/sales_clean.csv", index=False)
customers.to_csv("C:/Users/Abhi/Desktop/Power_BI_Data_Analysis_Project/retail-demand-customer-analytics/data/processed/clean/customers_clean.csv", index=False)
products.to_csv("C:/Users/Abhi/Desktop/Power_BI_Data_Analysis_Project/retail-demand-customer-analytics/data/processed/clean/products_clean.csv", index=False)
stores.to_csv("C:/Users/Abhi/Desktop/Power_BI_Data_Analysis_Project/retail-demand-customer-analytics/data/processed/clean/stores_clean.csv", index=False)